app/Controllers/Admin/Categorias.php

    public function atualizar($id = null) {

        if ($this->request->getMethod() === 'post') {
            $categoria = $this->buscarCategoriaOu404($id);

            if ($categoria->deletado_em != null) {
                return redirect()->back()->with('info', "A categoria $categoria->nome encontra-se excluida. Portanto, não é possível atualizá-la.");
            }



            $categoria->fill($this->request->getPost());

            if (!$categoria->hasChanged()) {
                return redirect()->back()->with('info', 'Não há dados para atualizar');
            }

            if ($this->categoriaModel->save($categoria)) {
---
UPDATE `categorias` SET `nome` = 'Pizza doce 32', `atualizado_em` = '2023-07-17 16:58:24'
WHERE `categorias`.`id` IN ('1')

    private function buscarCategoriaOu404(int $id = null) {
        if (!$id || !$categoria = $this->categoriaModel->withDeleted(true)->where('id', $id)->first()) {
---
SELECT *
FROM `categorias`
WHERE `id` = 1
GROUP BY `categorias`.`id`
ORDER BY `categorias`.`id` ASC
 LIMIT 1