app/Controllers/Admin/Expedientes.php

SELECT *
FROM `expediente`
---
    public function expedientes()
    {

        if($this->request->getMethod() === 'post'){

            $postExpedientes = $this->request->getPost();

            $arrayExpedientes = [];

            for($contador = 0; $contador < count($postExpedientes['dia_descricao']); $contador++){

                array_push($arrayExpedientes, [
                    'dia_descricao' => $postExpedientes['dia_descricao'][$contador],
                    'abertura' => $postExpedientes['abertura'][$contador],
                    'fechamento' => $postExpedientes['fechamento'][$contador],
                    'situacao' => $postExpedientes['situacao'][$contador],
                ]);

            }

            $this->expedienteModel->updateBatch($arrayExpedientes, 'dia_descricao');

            return redirect()->back()->with('sucesso', 'Expedientes atualizados com sucesso');
        }
        $data = [
            'titulo' => 'Gerenciar o horário de funcionamento',
            'expedientes' => $this->expedienteModel->findAll(),
        ];