app/Helpers/empresa_helper.php

SELECT *
FROM `expediente`
---
    function expedientes(){

        $expedienteModel = new \App\Models\ExpedienteModel();

        return $expedienteModel->findAll();

SELECT *
FROM `expediente`
WHERE `dia` = '1'
 LIMIT 1
---
    function expedienteHoje(){

        $expedienteModel = new \App\Models\ExpedienteModel();

        return $expedienteModel->where('dia', date('w'))->first();