app/Controllers/Produto.php

SELECT *
FROM `produtos`
WHERE `slug` = 'pizza-de-chocolate-com-morango'
AND `ativo` = 1
AND `produtos`.`deletado_em` IS NULL
 LIMIT 1
---
    public function detalhes(string $produto_slug = null)
    {

        if(!$produto_slug || !$produto = $this->produtoModel->where('slug', $produto_slug)->where('ativo', true)->first()){