app/Models/EntregadorModel.php

SELECT `entregadores`.`nome`, `entregadores`.`imagem`, COUNT(*) AS entregas
FROM `entregadores`
JOIN `pedidos` ON `pedidos`.`entregador_id` = `entregadores`.`id`
WHERE `pedidos`.`situacao` = 2
AND `entregadores`.`deletado_em` IS NULL
GROUP BY `entregadores`.`nome`
ORDER BY `entregas` DESC
 LIMIT 5
---
    public function recuperaEntregadoresMaisAssiduos(int $quantidade) {

        return $this->select('entregadores.nome, entregadores.imagem, COUNT(*) AS entregas')
                ->join('pedidos', 'pedidos.entregador_id = entregadores.id')
                ->where('pedidos.situacao', 2)
                ->limit($quantidade)
                ->groupBy('entregadores.nome')
                ->orderBy('entregas', 'DESC')
                ->find();