app/Models/ProdutoExtraModel.php

    public function buscaExtrasDoProdutoDetalhes(int $produto_id = null) {

        return $this
                ->select('extras.id, extras.nome, extras.preco, produtos_extras.id AS id_principal')
                ->join('extras', 'extras.id = produtos_extras.extra_id')
                ->join('produtos', 'produtos.id = produtos_extras.produto_id')
                ->where('produtos_extras.produto_id', $produto_id)
                ->findAll();
---
SELECT `extras`.`id`, `extras`.`nome`, `extras`.`preco`, `produtos_extras`.`id` AS `id_principal`
FROM `produtos_extras`
JOIN `extras` ON `extras`.`id` = `produtos_extras`.`extra_id`
JOIN `produtos` ON `produtos`.`id` = `produtos_extras`.`produto_id`
WHERE `produtos_extras`.`produto_id` = 1