app/Models/UsuarioModel.php

    public function recuperaTotalClientesAtivos() {

        return $this->where('is_admin', false)
                        ->where('ativo', true)
                        ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `usuarios`
WHERE `is_admin` = 0
AND `ativo` = 1
AND `usuarios`.`deletado_em` IS NULL